
export const BASE_URL = import.meta.env.VITE_BASE_URL;

export const ROLES = {
    ADMIN: 'ADMIN',
    COMMANDER: 'COMMANDER',
    DEPARTMENT_EMPLOYEE: 'DEPARTMENT_EMPLOYEE',
    INSTRUCTOR: 'INSTRUCTOR'
};

export const RANKS_LIST = [
    'солдат',
    'старший солдат',
    'молодший сержант',
    'сержант',
    'старший сержант',
    'головний сержант',
    'штаб-сержант',
    'майстер-сержант',
    'старший майстер-сержант',
    'головний майстер-сержант',
    'молодший лейтенант',
    'лейтенант',
    'старший лейтенант',
    'капітан',
    'майор',
    'підполковник',
    'полковник',
    'бригадний генерал',
    'генерал-майор',
    'генерал-лейтенант',
    'генерал',
];

export const INSTRUCTOR_POSITIONS_LIST = [
    'Викладач кафедри',
    'Старший викладач кафедри',
    'Доцент кафедри',
    'Професор кафедри',
    'Заступник начальника кафедри',
    'Начальник кафедри',
];

// Наукові ступені
export const ACADEMIC_DEGREES_LIST = [
    'кандидат наук',
    'доктор філософії',
    'доктор наук',
];

// Посади для курсанта
export const CADET_POSITIONS_LIST = [
    'Курсант',
    'Командир групи',
];

// Статуси відвідування
export const ATTENDANCE_STATUSES_LIST = [
    'Прибув',
    'Хворий',
    'Наряд',
    'Відрядження',
    'Відпустка',
    'Не відмічено'
];